Revit 2027 API
MorphedDistributionRebarHandles Enumeration
 This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form Morphed Distribution have. The tag of a [!:Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle] RebarConstrainedHandle can be obtained by calling the [!:Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()]
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MorphedDistributionRebarHandles
Public Enumeration MorphedDistributionRebarHandles
public enum class MorphedDistributionRebarHandles
type MorphedDistributionRebarHandles
Members
Member name | Value | Description
Definition | 1 |  Tag for handle that has constraints to target rebar's edges. This handle accepts constraints only to other rebar edges.
EndOfSet | 3 |  Tag for handle that that defines where the set ends. This handle accepts only constraints of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToCustomTarget] type.
StartOfSet | 2 |  Tag for handle that that defines where the set starts. This handle accepts only constraints of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToCustomTarget] type.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace